# SSD with Resnet 50 v1 FPN feature extractor, shared box predictor and focal
# loss (a.k.a Retinanet).
# See Lin et al, https://arxiv.org/abs/1708.02002
# Trained on COCO, initialized from Imagenet classification checkpoint

# Achieves 35.2 mAP on COCO14 minival dataset. Doubling the number of training
# steps to 50k gets 36.9 mAP

# This config is TPU compatible

model {
  ssd {
    inplace_batchnorm_update: true
    freeze_batchnorm: false
    num_classes: 105
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 1.0
        x_scale: 1.0
        height_scale: 1.0
        width_scale: 1.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.4
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: false
        use_matmul_gather: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    encode_background_as_zeros: true
    anchor_generator {
      multiscale_anchor_generator {
        min_level: 3
        max_level: 7
        anchor_scale: 1.0		
        aspect_ratios: [0.05, 0.3, 0.73, 2.5]        
        scales_per_octave: 2
      }
    }
    image_resizer {
      fixed_shape_resizer {
        height: 864
        width: 1216
      }
    }
    box_predictor {
      weight_shared_convolutional_box_predictor {
        depth: 256
        class_prediction_bias_init: -4.6
        conv_hyperparams {
          activation: RELU_6,
          regularizer {
            l2_regularizer {
              weight: 0.0004
            }
          }
          initializer {
            random_normal_initializer {
              stddev: 0.01
              mean: 0.0
            }
          }
          batch_norm {
            scale: true,
            decay: 0.997,
            epsilon: 0.001,
          }
        }
        num_layers_before_predictor: 4
        kernel_size: 3
      }
    }
    feature_extractor {
      type: 'ssd_resnet50_v1_fpn'
      fpn {
        min_level: 3
        max_level: 7
      }
      min_depth: 16
      depth_multiplier: 1.0
      conv_hyperparams {
        activation: RELU_6,
        regularizer {
          l2_regularizer {
            weight: 0.0004
          }
        }
        initializer {
          truncated_normal_initializer {
            stddev: 0.03
            mean: 0.0
          }
        }
        batch_norm {
          scale: true,
          decay: 0.997,
          epsilon: 0.001,
        }
      }
      override_base_feature_extractor_hyperparams: true
    }
    loss {
      classification_loss {
        weighted_sigmoid_focal {
          alpha: 0.25
          gamma: 2.0
        }
      }
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    normalize_loss_by_num_matches: true
    normalize_loc_loss_by_codesize: true
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-8
        iou_threshold: 0.5
        max_detections_per_class: 400
        max_total_detections: 1200
      }
      score_converter: SIGMOID
    }
  }
}

train_config: {
  # fine_tune_checkpoint: "C:/Users/Alex/Repositories/MusicObjectDetector-TF/MusicObjectDetector/data/ssd_resnet50_v1_fpn_shared_box_predictor_640x640_coco14_sync_2018_07_03/model.ckpt"
  batch_size: 1
  num_steps: 15000
  
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  
  optimizer {
    rms_prop_optimizer: {
      learning_rate: {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.003
          decay_steps: 20000
          decay_factor: 0.95
        }
      }
      momentum_optimizer_value: 0.9
      decay: 0.9
      epsilon: 1.0
    }
  }
  max_number_of_boxes: 1200
  unpad_groundtruth_tensors: false
}

train_input_reader: {
  tf_record_input_reader {
    input_path: "C:/Users/Alex/Repositories/MusicObjectDetector-TF/MusicObjectDetector/data/normalized/muscima/training.record"
  }
  label_map_path: "C:/Users/Alex/Repositories/MusicObjectDetector-TF/MusicObjectDetector/data/normalized/muscima/mapping.txt"
}

eval_config: {
  #metrics_set: "pascal_voc_detection_metrics"
  #metrics_set: "weighted_pascal_voc_detection_metrics"
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  num_examples: 280
  max_evals: 1
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "C:/Users/Alex/Repositories/MusicObjectDetector-TF/MusicObjectDetector/data/normalized/muscima/validation.record"
  }
  label_map_path: "C:/Users/Alex/Repositories/MusicObjectDetector-TF/MusicObjectDetector/data/normalized/muscima/mapping.txt"
  shuffle: false
  num_readers: 1
}