# SSD with Inception V2 and Focal Loss for MUSCIMA++ dataset

model {
  ssd {
    num_classes: 110
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: false
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    encode_background_as_zeros: true
	anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.2
        max_scale: 0.95
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 8.0
        aspect_ratios: 0.125
      }
    }    
    image_resizer {
      fixed_shape_resizer {
        height: 430
        width: 3000
      }
    }
    box_predictor {
      convolutional_box_predictor {
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.8
        kernel_size: 3
        box_code_size: 4
        apply_sigmoid_to_scores: false
        conv_hyperparams {
          activation: RELU_6,
          regularizer {
            l2_regularizer {
              weight: 0.00004
            }
          }
          initializer {
            truncated_normal_initializer {
              stddev: 0.03
              mean: 0.0
            }
          }
        }
      }
    }
    feature_extractor {
      type: 'ssd_inception_v2'
      min_depth: 16
      depth_multiplier: 1.0
      conv_hyperparams {
        activation: RELU_6,
        regularizer {
          l2_regularizer {
            weight: 0.00004
          }
        }
        initializer {
          truncated_normal_initializer {
            stddev: 0.03
            mean: 0.0
          }
        }
        batch_norm {
          train: true,
          scale: true,
          center: true,
          decay: 0.9997,
          epsilon: 0.001,
        }
      }
      override_base_feature_extractor_hyperparams: true
    }
    loss {
      classification_loss {
        weighted_sigmoid_focal {
          alpha: 0.75
          gamma: 2.0
        }
      }
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    normalize_loss_by_num_matches: true
    normalize_loc_loss_by_codesize: true
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-8
        iou_threshold: 0.5
        max_detections_per_class: 400
        max_total_detections: 1200
      }
      score_converter: SIGMOID
    }
  }
}

train_config: {
  batch_size: 1
  optimizer {
    rms_prop_optimizer: {
      learning_rate: {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.003
          decay_steps: 80000
          decay_factor: 0.95
        }
      }
      momentum_optimizer_value: 0.9
      decay: 0.9
      epsilon: 1.0
    }
  }
  
  fine_tune_checkpoint: "C:/Users/Alex/Repositories/MusicObjectDetector-TF/MusicObjectDetector/data/ssd_inception_v2_coco_2018_01_28/model.ckpt"
  from_detection_checkpoint: true
  fine_tune_checkpoint_type: "detection"
  
  num_steps: 80000
  
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    ssd_random_crop {
    }
  }
  
  max_number_of_boxes: 1000
  unpad_groundtruth_tensors: false
}

train_input_reader: {
  tf_record_input_reader {
    input_path: "C:/Users/Alex/Repositories/MusicObjectDetector-TF/MusicObjectDetector/data/stave_crop_writer_independent_split/training.record"
  }
  label_map_path: "C:/Users/Alex/Repositories/MusicObjectDetector-TF/MusicObjectDetector/mapping_all_classes.txt"
}

eval_config: {  
  # metrics_set: "pascal_voc_detection_metrics"
  # metrics_set: "weighted_pascal_voc_detection_metrics"
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  num_examples: 122
  # Note: The below line limits the evaluation process to 10 evaluations.
  # Remove the below line to evaluate indefinitely.
  max_evals: 1
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "C:/Users/Alex/Repositories/MusicObjectDetector-TF/MusicObjectDetector/data/stave_crop_writer_independent_split/validation.record"
    # input_path: "C:/Users/Alex/Repositories/MusicObjectDetector-TF/MusicObjectDetector/data/stave_crop_writer_independent_split/test.record"
  }
  label_map_path: "C:/Users/Alex/Repositories/MusicObjectDetector-TF/MusicObjectDetector/mapping_all_classes.txt"
  shuffle: false
  num_readers: 1
}
